[NoCoverage] BlockStatement
src/functions/calculator.ts:3:60
 import { add } from './calc';
 
-export function calculateSum(x: number, y: number): number {
-	return add(x, y);
-}
+export function calculateSum(x: number, y: number): number {}
 
