[NoCoverage] BlockStatement
src/step-definitions/fahrenheitToCelsius.steps.ts:7:34
 
 const feature = loadFeature('./src/features/fahrenheitToCelsius.feature');
 
-defineFeature(feature, (test) => {
-  let fahrenheit: number;
-  let celsius: number;
-
-  test('Convert Fahrenheit to Celsius', ({ given, when, then }) => {
-    given(/^the temperature in Fahrenheit is (\d+)$/, (f: number) => {
-      fahrenheit = f;
-    });
-
-    when('I convert the temperature to Celsius', () => {
-      celsius = fahrenheitToCelsius(fahrenheit);
-    });
-
-    then(/^the temperature in Celsius should be (\d+)$/, (expectedCelsius: number) => {
-      expect(celsius).toBe(Number(expectedCelsius));
-    });
-  });
-});
+defineFeature(feature, (test) => {});

[NoCoverage] BlockStatement
src/step-definitions/fahrenheitToCelsius.steps.ts:11:68
   let fahrenheit: number;
   let celsius: number;
 
-  test('Convert Fahrenheit to Celsius', ({ given, when, then }) => {
-    given(/^the temperature in Fahrenheit is (\d+)$/, (f: number) => {
-      fahrenheit = f;
-    });
-
-    when('I convert the temperature to Celsius', () => {
-      celsius = fahrenheitToCelsius(fahrenheit);
-    });
-
-    then(/^the temperature in Celsius should be (\d+)$/, (expectedCelsius: number) => {
-      expect(celsius).toBe(Number(expectedCelsius));
-    });
-  });
+  test('Convert Fahrenheit to Celsius', ({ given, when, then }) => {});
 });

[NoCoverage] BlockStatement
src/step-definitions/fahrenheitToCelsius.steps.ts:12:70
   let celsius: number;
 
   test('Convert Fahrenheit to Celsius', ({ given, when, then }) => {
-    given(/^the temperature in Fahrenheit is (\d+)$/, (f: number) => {
-      fahrenheit = f;
-    });
+    given(/^the temperature in Fahrenheit is (\d+)$/, (f: number) => {});
 
     when('I convert the temperature to Celsius', () => {

[NoCoverage] Regex
src/step-definitions/fahrenheitToCelsius.steps.ts:12:11
   let celsius: number;
 
   test('Convert Fahrenheit to Celsius', ({ given, when, then }) => {
-    given(/^the temperature in Fahrenheit is (\d+)$/, (f: number) => {
+    given(/^the temperature in Fahrenheit is (\D+)$/, (f: number) => {
       fahrenheit = f;
     });

[NoCoverage] BlockStatement
src/step-definitions/fahrenheitToCelsius.steps.ts:16:56
       fahrenheit = f;
     });
 
-    when('I convert the temperature to Celsius', () => {
-      celsius = fahrenheitToCelsius(fahrenheit);
-    });
+    when('I convert the temperature to Celsius', () => {});
 
     then(/^the temperature in Celsius should be (\d+)$/, (expectedCelsius: number) => {

[NoCoverage] BlockStatement
src/step-definitions/fahrenheitToCelsius.steps.ts:20:87
       celsius = fahrenheitToCelsius(fahrenheit);
     });
 
-    then(/^the temperature in Celsius should be (\d+)$/, (expectedCelsius: number) => {
-      expect(celsius).toBe(Number(expectedCelsius));
-    });
+    then(/^the temperature in Celsius should be (\d+)$/, (expectedCelsius: number) => {});
   });
 });
