[Killed] EqualityOperator
src/functions/romanToNumeral.ts:16:19
 
   let arabic = 0;
 
-  for (let i = 0; i < roman.length; i++) {
+  for (let i = 0; i <= roman.length; i++) {
     const currentChar = roman[i] as RomanNumerals;
     const nextChar = roman[i + 1] as RomanNumerals;
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: NaN

[Killed] ConditionalExpression
src/functions/romanToNumeral.ts:16:19
 
   let arabic = 0;
 
-  for (let i = 0; i < roman.length; i++) {
+  for (let i = 0; false; i++) {
     const currentChar = roman[i] as RomanNumerals;
     const nextChar = roman[i + 1] as RomanNumerals;
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 0

[Killed] ConditionalExpression
src/functions/romanToNumeral.ts:20:9
     const currentChar = roman[i] as RomanNumerals;
     const nextChar = roman[i + 1] as RomanNumerals;
 
-    if (romanNumerals[currentChar] < romanNumerals[nextChar]) {
+    if (true) {
       arabic -= romanNumerals[currentChar];
     } else {
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: -16

[Killed] ConditionalExpression
src/functions/romanToNumeral.ts:20:9
     const currentChar = roman[i] as RomanNumerals;
     const nextChar = roman[i + 1] as RomanNumerals;
 
-    if (romanNumerals[currentChar] < romanNumerals[nextChar]) {
+    if (false) {
       arabic -= romanNumerals[currentChar];
     } else {
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 16

[Killed] AssignmentOperator
src/functions/romanToNumeral.ts:21:7
     const nextChar = roman[i + 1] as RomanNumerals;
 
     if (romanNumerals[currentChar] < romanNumerals[nextChar]) {
-      arabic -= romanNumerals[currentChar];
+      arabic += romanNumerals[currentChar];
     } else {
       arabic += romanNumerals[currentChar];
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 16

[Killed] BlockStatement
src/functions/romanToNumeral.ts:22:12
 
     if (romanNumerals[currentChar] < romanNumerals[nextChar]) {
       arabic -= romanNumerals[currentChar];
-    } else {
-      arabic += romanNumerals[currentChar];
-    }
+    } else {}
   }
 
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: -1

[Killed] AssignmentOperator
src/functions/romanToNumeral.ts:23:7
     if (romanNumerals[currentChar] < romanNumerals[nextChar]) {
       arabic -= romanNumerals[currentChar];
     } else {
-      arabic += romanNumerals[currentChar];
+      arabic -= romanNumerals[currentChar];
     }
   }
killedBy: Test Roman-Numbers to Arabic-Numbers Function: RomanToArabicNumbers_RomanIsXIV_Returns14
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: -16
