[Killed] BlockStatement
src/functions/fahrenheit-to-celsius.ts:1:68
-export const fahrenheitToCelsius = (fahrenheit: number): number => {
-  return Math.round((fahrenheit - 32) * (5 / 9));
-}
+export const fahrenheitToCelsius = (fahrenheit: number): number => {}
killedBy: Test Fahrenheit-To-Celsius Function: FahrenheitToCelsius_FahrenheitIs60_CelsiusIs16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: undefined

[Killed] ArithmeticOperator
src/functions/fahrenheit-to-celsius.ts:2:21
 export const fahrenheitToCelsius = (fahrenheit: number): number => {
-  return Math.round((fahrenheit - 32) * (5 / 9));
+  return Math.round((fahrenheit - 32) / (5 / 9));
 }
killedBy: Test Fahrenheit-To-Celsius Function: FahrenheitToCelsius_FahrenheitIs60_CelsiusIs16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 50

[Killed] ArithmeticOperator
src/functions/fahrenheit-to-celsius.ts:2:42
 export const fahrenheitToCelsius = (fahrenheit: number): number => {
-  return Math.round((fahrenheit - 32) * (5 / 9));
+  return Math.round((fahrenheit - 32) * (5 * 9));
 }
killedBy: Test Fahrenheit-To-Celsius Function: FahrenheitToCelsius_FahrenheitIs60_CelsiusIs16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 1260
