[Killed] BlockStatement
src/functions/calc.ts:1:54
-export const add = (x: number, y: number): number => {
-  return x + y;
-}
+export const add = (x: number, y: number): number => {}
killedBy: 2 (Two Katas) Test Add Function: Add_10And5_15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] ArithmeticOperator
src/functions/calc.ts:2:10
 export const add = (x: number, y: number): number => {
-  return x + y;
+  return x - y;
 }
killedBy: 2 (Two Katas) Test Add Function: Add_10And5_15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 5
